; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 713200 2 3 3 5 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	spectrograph1 - mode
	thermograph2 - mode
	Star2 - direction
	Star4 - direction
	Star0 - direction
	GroundStation3 - direction
	Star1 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star1)
	(supports instrument5 image0)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite0 Planet6)
	(pointing satellite1 Planet6)
	(have_image Phenomenon5 spectrograph1)
	(have_image Planet6 spectrograph1)
	(have_image Star7 spectrograph1)
))

)

; plan
1. (turn_to satellite1 planet6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet6)
   goals met: 1 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 5
4. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 1 of 5
5. (turn_to satellite1 phenomenon5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon5)
   goals met: 0 of 5
6. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   goals met: 0 of 5
7. (turn_to satellite1 planet6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet6)
   goals met: 1 of 5
8. (take_image satellite0 star7 instrument0 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 2 of 5
9. (turn_to satellite1 phenomenon5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon5)
   goals met: 1 of 5
10. (turn_to satellite0 planet6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet6)
   goals met: 2 of 5
11. (turn_to satellite1 planet6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet6)
   goals met: 3 of 5
12. (take_image satellite0 planet6 instrument0 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 4 of 5
13. (turn_to satellite0 phenomenon5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 5
14. (take_image satellite0 phenomenon5 instrument0 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 4 of 5
15. (turn_to satellite0 planet6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet6)
   goals met: 5 of 5
